node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 105
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 105
          }
        }
        tensor_content: "\000\000\000\000\000\000\014@\000\000\000\000\000\000\026@\315\314\314\314\314\314\026@\000\000\000\000\000\000\024@333333\027@333333\017@ffffff\030@\315\314\314\314\314\314\022@ffffff\016@\232\231\231\231\231\231\023@ffffff\024@\000\000\000\000\000\000\022@\000\000\000\000\000\000\024@\315\314\314\314\314\314\022@\315\314\314\314\314\314\024@\000\000\000\000\000\000\022@\232\231\231\231\231\231\371?ffffff\024@\315\314\314\314\314\314\020@\315\314\314\314\314\314\014@\000\000\000\000\000\000\020@ffffff\022@\000\000\000\000\000\000\030@\000\000\000\000\000\000\370?\232\231\231\231\231\231\361?333333\025@\315\314\314\314\314\314\020@333333\373?\000\000\000\000\000\000\370?\232\231\231\231\231\231\023@\000\000\000\000\000\000\370?ffffff\024@\000\000\000\000\000\000\010@ffffff\366?\000\000\000\000\000\000\022@ffffff\030@\315\314\314\314\314\314\020@ffffff\366?\232\231\231\231\231\231\027@\315\314\314\314\314\314\026@333333\027@ffffff\026@\232\231\231\231\231\231\371?\232\231\231\231\231\231\371?ffffff\024@\315\314\314\314\314\314\026@\315\314\314\314\314\314\364?\232\231\231\231\231\231\025@ffffff\366?\000\000\000\000\000\000\024@\232\231\231\231\231\231\025@\315\314\314\314\314\314\364?ffffff\366?333333\027@ffffff\366?\315\314\314\314\314\314\364?333333\373?\000\000\000\000\000\000\020@\232\231\231\231\231\231\027@ffffff\032@ffffff\366?\000\000\000\000\000\000\370?ffffff\366?\000\000\000\000\000\000\022@\232\231\231\231\231\231\021@333333\363?333333\373?333333\021@\000\000\000\000\000\000\370?\232\231\231\231\231\231\033@ffffff\n@\232\231\231\231\231\231\031@\232\231\231\231\231\231\021@\000\000\000\000\000\000\370?333333\023@333333\363?\315\314\314\314\314\314\032@\000\000\000\000\000\000\370?\232\231\231\231\231\231\371?ffffff\030@ffffff\366?ffffff\026@ffffff\020@333333\017@\000\000\000\000\000\000\014@333333\025@\315\314\314\314\314\314\024@\232\231\231\231\231\231\023@\000\000\000\000\000\000\024@\232\231\231\231\231\231\371?\232\231\231\231\231\231\r@ffffff\026@ffffff\024@\000\000\000\000\000\000\370?ffffff\022@ffffff\020@333333\023@\232\231\231\231\231\231\021@\315\314\314\314\314\314\364?\000\000\000\000\000\000\370?\000\000\000\000\000\000\370?ffffff\026@ffffff\020@\315\314\314\314\314\314\032@ffffff\366?"
      }
    }
  }
}
node {
  name: "tensors/component_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 105
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 105
          }
        }
        tensor_content: "\000\000\000\000\000\000\360?\315\314\314\314\314\314\374?\000\000\000\000\000\000\004@\000\000\000\000\000\000\370?\315\314\314\314\314\314\374?\232\231\231\231\231\231\361?ffffff\002@\232\231\231\231\231\231\371?\232\231\231\231\231\231\361?\315\314\314\314\314\314\374?\000\000\000\000\000\000\370?333333\373?ffffff\376?ffffff\366?\000\000\000\000\000\000\000@\232\231\231\231\231\231\371?\232\231\231\231\231\231\311?ffffff\376?\315\314\314\314\314\314\364?\315\314\314\314\314\314\364?\315\314\314\314\314\314\364?ffffff\366?\315\314\314\314\314\314\374?\232\231\231\231\231\231\311?\232\231\231\231\231\231\271?ffffff\376?333333\363?\232\231\231\231\231\231\311?\232\231\231\231\231\231\331?\000\000\000\000\000\000\370?\232\231\231\231\231\231\311?\315\314\314\314\314\314\374?\232\231\231\231\231\231\361?333333\323?\000\000\000\000\000\000\370?\000\000\000\000\000\000\004@\315\314\314\314\314\314\364?\232\231\231\231\231\231\271?\315\314\314\314\314\314\000@ffffff\002@\232\231\231\231\231\231\001@\315\314\314\314\314\314\000@\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\000\000\000\000\000\000\000@\315\314\314\314\314\314\000@333333\323?ffffff\002@\232\231\231\231\231\231\311?\000\000\000\000\000\000\000@\315\314\314\314\314\314\000@\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\232\231\231\231\231\231\371?333333\323?\232\231\231\231\231\231\311?\232\231\231\231\231\231\331?\315\314\314\314\314\314\364?ffffff\002@\315\314\314\314\314\314\000@\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\232\231\231\231\231\231\311?\315\314\314\314\314\314\364?ffffff\366?\232\231\231\231\231\231\311?\000\000\000\000\000\000\340?\315\314\314\314\314\314\364?\232\231\231\231\231\231\331?ffffff\002@\000\000\000\000\000\000\360?\000\000\000\000\000\000\000@ffffff\366?\232\231\231\231\231\231\271?\315\314\314\314\314\314\374?\232\231\231\231\231\231\311?\000\000\000\000\000\000\000@333333\323?\232\231\231\231\231\231\311?ffffff\376?\232\231\231\231\231\231\311?333333\003@\315\314\314\314\314\314\364?333333\363?\000\000\000\000\000\000\360?ffffff\002@ffffff\002@\000\000\000\000\000\000\370?333333\373?\232\231\231\231\231\231\311?\000\000\000\000\000\000\360?333333\003@ffffff\376?\232\231\231\231\231\231\311?\315\314\314\314\314\314\364?\315\314\314\314\314\314\364?\315\314\314\314\314\314\374?\315\314\314\314\314\314\364?\232\231\231\231\231\231\311?\232\231\231\231\231\231\331?\232\231\231\231\231\231\271?\315\314\314\314\314\314\374?\000\000\000\000\000\000\360?\232\231\231\231\231\231\001@\232\231\231\231\231\231\311?"
      }
    }
  }
}
node {
  name: "tensors/component_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 105
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 105
          }
        }
        tensor_content: "\000\000\000\000\000\000\024@\000\000\000\000\000\000\032@\315\314\314\314\314\314\032@\000\000\000\000\000\000\030@\315\314\314\314\314\314\032@ffffff\026@\315\314\314\314\314\314\036@333333\031@\000\000\000\000\000\000\026@333333\031@333333\031@\232\231\231\231\231\231\023@333333\031@\000\000\000\000\000\000\034@\000\000\000\000\000\000\032@\000\000\000\000\000\000\030@333333\023@333333\027@ffffff\026@ffffff\026@\000\000\000\000\000\000\026@ffffff\030@\315\314\314\314\314\314\034@333333\025@333333\021@\232\231\231\231\231\231\031@\315\314\314\314\314\314\026@\232\231\231\231\231\231\025@\315\314\314\314\314\314\026@\232\231\231\231\231\231\033@ffffff\022@\232\231\231\231\231\231\027@ffffff\024@ffffff\022@\315\314\314\314\314\314\030@\315\314\314\314\314\314\034@\315\314\314\314\314\314\026@333333\023@ffffff\034@\232\231\231\231\231\231\033@\000\000\000\000\000\000\032@\232\231\231\231\231\231\031@ffffff\024@333333\023@\000\000\000\000\000\000\032@\315\314\314\314\314\314\032@\000\000\000\000\000\000\022@\315\314\314\314\314\314\030@\232\231\231\231\231\231\023@\315\314\314\314\314\314\026@\232\231\231\231\231\231\033@\232\231\231\231\231\231\021@\000\000\000\000\000\000\024@\315\314\314\314\314\314\034@ffffff\024@\232\231\231\231\231\231\021@\232\231\231\231\231\231\025@\000\000\000\000\000\000\026@333333\033@ffffff\036@ffffff\024@\232\231\231\231\231\231\023@\315\314\314\314\314\314\024@\315\314\314\314\314\314\026@ffffff\032@\000\000\000\000\000\000\024@ffffff\024@\232\231\231\231\231\231\031@\232\231\231\231\231\231\025@\315\314\314\314\314\314\036@\232\231\231\231\231\231\023@\232\231\231\231\231\231\037@\315\314\314\314\314\314\032@\315\314\314\314\314\314\024@\000\000\000\000\000\000\030@333333\027@\315\314\314\314\314\314\036@ffffff\024@\315\314\314\314\314\314\022@\232\231\231\231\231\231\035@\000\000\000\000\000\000\024@333333\031@\315\314\314\314\314\314\026@333333\027@\315\314\314\314\314\314\026@\232\231\231\231\231\231\031@\315\314\314\314\314\314\032@333333\031@\315\314\314\314\314\314\032@\000\000\000\000\000\000\024@\000\000\000\000\000\000\026@\315\314\314\314\314\314\032@333333\027@ffffff\024@ffffff\032@ffffff\026@\232\231\231\231\231\231\027@333333\031@\000\000\000\000\000\000\026@ffffff\024@\232\231\231\231\231\231\023@333333\031@333333\027@\315\314\314\314\314\314\036@ffffff\022@"
      }
    }
  }
}
node {
  name: "tensors/component_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 105
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 105
          }
        }
        tensor_content: "\000\000\000\000\000\000\000@\000\000\000\000\000\000\010@ffffff\n@\232\231\231\231\231\231\001@\000\000\000\000\000\000\004@\000\000\000\000\000\000\004@\000\000\000\000\000\000\010@ffffff\n@333333\003@\232\231\231\231\231\231\005@ffffff\006@\000\000\000\000\000\000\004@\000\000\000\000\000\000\004@\232\231\231\231\231\231\t@\000\000\000\000\000\000\010@333333\013@\315\314\314\314\314\314\010@\232\231\231\231\231\231\005@\232\231\231\231\231\231\005@333333\007@\000\000\000\000\000\000\004@\000\000\000\000\000\000\010@\232\231\231\231\231\231\t@\232\231\231\231\231\231\r@\000\000\000\000\000\000\010@\232\231\231\231\231\231\005@\000\000\000\000\000\000\010@333333\013@\232\231\231\231\231\231\021@\315\314\314\314\314\314\010@\315\314\314\314\314\314\010@\000\000\000\000\000\000\010@\000\000\000\000\000\000\004@333333\013@\232\231\231\231\231\231\001@\315\314\314\314\314\314\014@333333\007@\000\000\000\000\000\000\010@\000\000\000\000\000\000\010@\232\231\231\231\231\231\t@\000\000\000\000\000\000\010@ffffff\006@ffffff\016@333333\013@\232\231\231\231\231\231\t@ffffff\n@ffffff\002@333333\013@\000\000\000\000\000\000\010@\000\000\000\000\000\000\004@\315\314\314\314\314\314\010@\232\231\231\231\231\231\t@\315\314\314\314\314\314\014@\000\000\000\000\000\000\010@\000\000\000\000\000\000\014@\000\000\000\000\000\000\010@333333\017@ffffff\002@\232\231\231\231\231\231\t@\000\000\000\000\000\000\010@\000\000\000\000\000\000\014@\315\314\314\314\314\314\010@333333\013@ffffff\006@\000\000\000\000\000\000\010@\232\231\231\231\231\231\t@ffffff\n@333333\007@333333\013@\315\314\314\314\314\314\004@333333\003@ffffff\016@\315\314\314\314\314\314\010@ffffff\020@\000\000\000\000\000\000\010@\000\000\000\000\000\000\020@ffffff\006@ffffff\016@\232\231\231\231\231\231\t@ffffff\006@ffffff\n@333333\013@ffffff\006@\232\231\231\231\231\231\005@\315\314\314\314\314\314\004@\232\231\231\231\231\231\t@\000\000\000\000\000\000\010@\000\000\000\000\000\000\004@\000\000\000\000\000\000\010@\000\000\000\000\000\000\010@333333\003@\315\314\314\314\314\314\010@\232\231\231\231\231\231\005@333333\013@333333\007@\000\000\000\000\000\000\010@\232\231\231\231\231\231\t@ffffff\002@\000\000\000\000\000\000\014@\232\231\231\231\231\231\r@\315\314\314\314\314\314\010@333333\007@\232\231\231\231\231\231\005@ffffff\016@\232\231\231\231\231\231\t@"
      }
    }
  }
}
node {
  name: "tensors/component_4"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 105
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 105
          }
        }
        string_val: "versicolor"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "versicolor"
        string_val: "virginica"
        string_val: "versicolor"
        string_val: "versicolor"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "versicolor"
        string_val: "virginica"
        string_val: "versicolor"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "versicolor"
        string_val: "versicolor"
        string_val: "versicolor"
        string_val: "versicolor"
        string_val: "virginica"
        string_val: "setosa"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "versicolor"
        string_val: "setosa"
        string_val: "setosa"
        string_val: "versicolor"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "versicolor"
        string_val: "setosa"
        string_val: "versicolor"
        string_val: "virginica"
        string_val: "versicolor"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "setosa"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "setosa"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "setosa"
        string_val: "setosa"
        string_val: "setosa"
        string_val: "versicolor"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "setosa"
        string_val: "setosa"
        string_val: "setosa"
        string_val: "versicolor"
        string_val: "versicolor"
        string_val: "setosa"
        string_val: "setosa"
        string_val: "versicolor"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "versicolor"
        string_val: "virginica"
        string_val: "versicolor"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "setosa"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "versicolor"
        string_val: "versicolor"
        string_val: "versicolor"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "versicolor"
        string_val: "versicolor"
        string_val: "setosa"
        string_val: "versicolor"
        string_val: "virginica"
        string_val: "virginica"
        string_val: "setosa"
        string_val: "versicolor"
        string_val: "versicolor"
        string_val: "versicolor"
        string_val: "versicolor"
        string_val: "setosa"
        string_val: "setosa"
        string_val: "setosa"
        string_val: "virginica"
        string_val: "versicolor"
        string_val: "virginica"
        string_val: "setosa"
      }
    }
  }
}
node {
  name: "buffer_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1000
      }
    }
  }
}
node {
  name: "seed"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "seed2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "count"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "batch_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 32
      }
    }
  }
}
node {
  name: "drop_remainder"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "Iterator"
  op: "Iterator"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_STRING
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "TensorSliceDataset"
  op: "TensorSliceDataset"
  input: "tensors/component_0"
  input: "tensors/component_1"
  input: "tensors/component_2"
  input: "tensors/component_3"
  input: "tensors/component_4"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_STRING
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "ShuffleDataset"
  op: "ShuffleDataset"
  input: "TensorSliceDataset"
  input: "buffer_size"
  input: "seed"
  input: "seed2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_STRING
      }
    }
  }
  attr {
    key: "reshuffle_each_iteration"
    value {
      b: true
    }
  }
}
node {
  name: "RepeatDataset"
  op: "RepeatDataset"
  input: "ShuffleDataset"
  input: "count"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_STRING
      }
    }
  }
}
node {
  name: "BatchDatasetV2"
  op: "BatchDatasetV2"
  input: "RepeatDataset"
  input: "batch_size"
  input: "drop_remainder"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_STRING
      }
    }
  }
}
node {
  name: "MakeIterator"
  op: "MakeIterator"
  input: "BatchDatasetV2"
  input: "Iterator"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
}
node {
  name: "IteratorToStringHandle"
  op: "IteratorToStringHandle"
  input: "Iterator"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "IteratorGetNext"
  op: "IteratorGetNext"
  input: "Iterator"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_STRING
      }
    }
  }
}
node {
  name: "Shape"
  op: "Shape"
  input: "IteratorGetNext:2"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "strided_slice/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "strided_slice/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice"
  op: "StridedSlice"
  input: "Shape"
  input: "strided_slice/stack"
  input: "strided_slice/stack_1"
  input: "strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "Shape_1"
  op: "Shape"
  input: "IteratorGetNext:3"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "strided_slice_1/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice_1"
  op: "StridedSlice"
  input: "Shape_1"
  input: "strided_slice_1/stack"
  input: "strided_slice_1/stack_1"
  input: "strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "assert_equal/Equal"
  op: "Equal"
  input: "strided_slice"
  input: "strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "assert_equal/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "assert_equal/All"
  op: "All"
  input: "assert_equal/Equal"
  input: "assert_equal/Const"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "assert_equal/Assert/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "assert_equal/Assert/Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Condition x == y did not hold element-wise:"
      }
    }
  }
}
node {
  name: "assert_equal/Assert/Const_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "x (strided_slice:0) = "
      }
    }
  }
}
node {
  name: "assert_equal/Assert/Const_3"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "y (strided_slice_1:0) = "
      }
    }
  }
}
node {
  name: "assert_equal/Assert/Assert/data_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "assert_equal/Assert/Assert/data_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Condition x == y did not hold element-wise:"
      }
    }
  }
}
node {
  name: "assert_equal/Assert/Assert/data_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "x (strided_slice:0) = "
      }
    }
  }
}
node {
  name: "assert_equal/Assert/Assert/data_4"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "y (strided_slice_1:0) = "
      }
    }
  }
}
node {
  name: "assert_equal/Assert/Assert"
  op: "Assert"
  input: "assert_equal/All"
  input: "assert_equal/Assert/Assert/data_0"
  input: "assert_equal/Assert/Assert/data_1"
  input: "assert_equal/Assert/Assert/data_2"
  input: "strided_slice"
  input: "assert_equal/Assert/Assert/data_4"
  input: "strided_slice_1"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
        type: DT_STRING
        type: DT_INT32
        type: DT_STRING
        type: DT_INT32
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "Shape_2"
  op: "Shape"
  input: "IteratorGetNext"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "strided_slice_2/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice_2"
  op: "StridedSlice"
  input: "Shape_2"
  input: "strided_slice_2/stack"
  input: "strided_slice_2/stack_1"
  input: "strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "assert_equal_1/Equal"
  op: "Equal"
  input: "strided_slice"
  input: "strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "assert_equal_1/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "assert_equal_1/All"
  op: "All"
  input: "assert_equal_1/Equal"
  input: "assert_equal_1/Const"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "assert_equal_1/Assert/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "assert_equal_1/Assert/Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Condition x == y did not hold element-wise:"
      }
    }
  }
}
node {
  name: "assert_equal_1/Assert/Const_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "x (strided_slice:0) = "
      }
    }
  }
}
node {
  name: "assert_equal_1/Assert/Const_3"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "y (strided_slice_2:0) = "
      }
    }
  }
}
node {
  name: "assert_equal_1/Assert/Assert/data_0"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: ""
      }
    }
  }
}
node {
  name: "assert_equal_1/Assert/Assert/data_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "Condition x == y did not hold element-wise:"
      }
    }
  }
}
node {
  name: "assert_equal_1/Assert/Assert/data_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "x (strided_slice:0) = "
      }
    }
  }
}
node {
  name: "assert_equal_1/Assert/Assert/data_4"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
        }
        string_val: "y (strided_slice_2:0) = "
      }
    }
  }
}
node {
  name: "assert_equal_1/Assert/Assert"
  op: "Assert"
  input: "assert_equal_1/All"
  input: "assert_equal_1/Assert/Assert/data_0"
  input: "assert_equal_1/Assert/Assert/data_1"
  input: "assert_equal_1/Assert/Assert/data_2"
  input: "strided_slice"
  input: "assert_equal_1/Assert/Assert/data_4"
  input: "strided_slice_2"
  attr {
    key: "T"
    value {
      list {
        type: DT_STRING
        type: DT_STRING
        type: DT_STRING
        type: DT_INT32
        type: DT_STRING
        type: DT_INT32
      }
    }
  }
  attr {
    key: "summarize"
    value {
      i: 3
    }
  }
}
node {
  name: "Shape_3"
  op: "Shape"
  input: "IteratorGetNext:1"
  attr {
    key: "T"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "strided_slice_3/stack"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "strided_slice_3"
  op: "StridedSlice"
  input: "Shape_3"
  input: "strided_slice_3/stack"
  input: "strided_slice_3/stack_1"
  input: "strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "assert_equal_2/Equal"
  op: "Equal"
  input: "strided_slice"
  input: "strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "assert_equal_2/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "assert_equal_2/All"
  op: "All"
  input: "assert_equal_2/Equal"
  input: "assert_equal_2/Const"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
